In [17]:
import pandas as pd
import numpy as np

In [18]:
#read a CSV file

customer_seg = pd.read_csv('boston.csv')

In [19]:
customer_seg.head(5)

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

In [20]:
customer_seg[(customer_seg.nox<0.5)&(customer_seg.rm>4)]

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
5,0.02985,0.0,2.18,0,0.458,6.430,58.7,6.0622,3,222,18.7,394.12,5.21,28.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
351,0.07950,60.0,1.69,0,0.411,6.579,35.9,10.7103,4,411,18.3,370.78,5.49,24.1
352,0.07244,60.0,1.69,0,0.411,5.884,18.5,10.7103,4,411,18.3,392.33,7.79,18.6
353,0.01709,90.0,2.02,0,0.410,6.728,36.1,12.1265,5,187,17.0,384.46,4.50,30.1
354,0.04301,80.0,1.91,0,0.413,5.663,21.9,10.5857,4,334,22.0,382.80,8.05,18.2
355,0.10659,80.0,1.91,0,0.413,5.936,19.5,10.5857,4,334,22.0,376.04,5.57,20.6

In [21]:
customer_seg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
crim       506 non-null float64
zn         506 non-null float64
indus      506 non-null float64
chas       506 non-null int64
nox        506 non-null float64
rm         506 non-null float64
age        506 non-null float64
dis        506 non-null float64
rad        506 non-null int64
tax        506 non-null int64
ptratio    506 non-null float64
black      506 non-null float64
lstat      506 non-null float64
medv       506 non-null float64
dtypes: float64(11), int64(3)
memory usage: 55.5 KB

In [22]:
customer_seg.rm.dtype

dtype('float64')

In [23]:
customer_seg['rm'] = customer_seg['rm'].astype(int)

In [24]:
customer_seg.rm.dtype

dtype('int32')

In [25]:
customer_seg['rm']

0      6
1      6
2      7
3      6
4      7
      ..
501    6
502    6
503    6
504    6
505    6
Name: rm, Length: 506, dtype: int32

In [26]:
customer_seg[(customer_seg['crim']==0.04301)].loc[:,'rm']

354    5
Name: rm, dtype: int32

In [27]:
#creating a new column

In [28]:
customer_seg['New Col'] = customer_seg['crim']+2

In [29]:
customer_seg

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,New Col
0,0.00632,18.0,2.31,0,0.538,6,65.2,4.0900,1,296,15.3,396.90,4.98,24.0,2.00632
1,0.02731,0.0,7.07,0,0.469,6,78.9,4.9671,2,242,17.8,396.90,9.14,21.6,2.02731
2,0.02729,0.0,7.07,0,0.469,7,61.1,4.9671,2,242,17.8,392.83,4.03,34.7,2.02729
3,0.03237,0.0,2.18,0,0.458,6,45.8,6.0622,3,222,18.7,394.63,2.94,33.4,2.03237
4,0.06905,0.0,2.18,0,0.458,7,54.2,6.0622,3,222,18.7,396.90,5.33,36.2,2.06905
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6,69.1,2.4786,1,273,21.0,391.99,9.67,22.4,2.06263
502,0.04527,0.0,11.93,0,0.573,6,76.7,2.2875,1,273,21.0,396.90,9.08,20.6,2.04527
503,0.06076,0.0,11.93,0,0.573,6,91.0,2.1675,1,273,21.0,396.90,5.64,23.9,2.06076
504,0.10959,0.0,11.93,0,0.573,6,89.3,2.3889,1,273,21.0,393.45,6.48,22.0,2.10959
505,0.04741,0.0,11.93,0,0.573,6,80.8,2.5050,1,273,21.0,396.90,7.88,11.9,2.04741

In [30]:
customer_seg['tax']+100

0      396
1      342
2      342
3      322
4      322
      ...
501    373
502    373
503    373
504    373
505    373
Name: tax, Length: 506, dtype: int64

In [31]:
customer_seg.crm.info()

AttributeError: 'DataFrame' object has no attribute 'crm'

In [32]:
customer_seg.drop('New Col',axis=1)

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6,69.1,2.4786,1,273,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6,76.7,2.2875,1,273,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6,91.0,2.1675,1,273,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6,89.3,2.3889,1,273,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6,80.8,2.5050,1,273,21.0,396.90,7.88,11.9

In [33]:
ipl_data = pd.DataFrame({'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings','Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]})

In [34]:
ipl_data

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [35]:
ipl_data.rename(columns={'Points':'Rewards'}) #group by excercise

      Team  Rank  Year  Rewards
0   Riders     1  2014      876
1   Riders     2  2015      789
2   Devils     2  2014      863
3   Devils     3  2015      673
4    Kings     3  2014      741
5    Kings     4  2015      812
6    Kings     1  2016      756
7    Kings     1  2017      788
8   Riders     2  2016      694
9   Royals     4  2014      701
10  Royals     1  2015      804
11  Riders     2  2017      690

In [36]:
#Define a object for groupby Variable

Groupset = ipl_data.groupby('Team')

In [37]:
Groupset

In [38]:
Groupset['Points'].agg(np.mean)

Team
Devils    768.00
Kings     774.25
Riders    762.25
Royals    752.50
Name: Points, dtype: float64

In [39]:
Groupset['Points'].agg(min)

Team
Devils    673
Kings     741
Riders    690
Royals    701
Name: Points, dtype: int64

In [40]:
Groupset['Points'].agg(max)

Team
Devils    863
Kings     812
Riders    876
Royals    804
Name: Points, dtype: int64

In [41]:
Groupset.agg({'Points':['min','max','mean']})

       Points
          min  max    mean
Team
Devils    673  863  768.00
Kings     741  812  774.25
Riders    690  876  762.25
Royals    701  804  752.50

In [42]:
Groupset.agg({'Points':['min','max','mean'],'Rank':['min']})

       Points              Rank
          min  max    mean  min
Team
Devils    673  863  768.00    2
Kings     741  812  774.25    1
Riders    690  876  762.25    1
Royals    701  804  752.50    1

In [43]:
#for above data group by year and find out max score received across each year for rank = 1

In [44]:
#Data Operation in Pandas

In [45]:
#declare a movie rating dataframe : ratings from 1 to 5

In [46]:
df_movie_rating = pd.DataFrame({'StarWars':[2,4,5,3,1],'Fast n Furious':[2,5,1,3,2]},index=['Tom','Harry','Flint','Tobby','Karl'])

In [47]:
df_movie_rating

       StarWars  Fast n Furious
Tom           2               2
Harry         4               5
Flint         5               1
Tobby         3               3
Karl          1               2

In [48]:
#define a movie grade function

def moviegrade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    if rating==2:
        return 'D'
    if rating==1:
        return 'E'

In [49]:
#test

rating = 5

In [50]:
moviegrade(4)

'B'

In [51]:
df_movie_rating.applymap(moviegrade)

      StarWars Fast n Furious
Tom          D              D
Harry        B              A
Flint        A              E
Tobby        C              C
Karl         E              D

In [52]:
# Data operations with Stats Functions

In [53]:
df_test_scores = pd.DataFrame({'Test1':[23,45,78,34],'Test2':[56,78,33,89]},index=['Tom','Larry','Stan','Olaff'])

In [54]:
df_test_scores

       Test1  Test2
Tom       23     56
Larry     45     78
Stan      78     33
Olaff     34     89

In [55]:
df_test_scores.max()

Test1    78
Test2    89
dtype: int64

In [56]:
df_test_scores.min()

Test1    23
Test2    33
dtype: int64

In [57]:
df_test_scores.mean()

Test1    45.0
Test2    64.0
dtype: float64

In [58]:
df_test_scores.std()

Test1    23.762716
Test2    24.805913
dtype: float64

In [59]:
# Data operations using group by

In [60]:
df_president_name = pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],'last':['Bush','Clinton','Regan','Carter','Washington']})

In [61]:
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [62]:
Group1 = df_president_name.groupby('first')

In [63]:
Group1

In [64]:
grp_data = Group1.get_group('George')

In [65]:
grp_data

    first        last
0  George        Bush
4  George  Washington

In [66]:
df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

# Data Standardization

In [67]:
#define a STD function

In [68]:
def standardization(test):
    return(test-test.mean()/test.std())

In [70]:
print(standardization(df_test_scores['Test1']))
print(df_test_scores['Test1'])

Tom      21.106277
Larry    43.106277
Stan     76.106277
Olaff    32.106277
Name: Test1, dtype: float64
Tom      23
Larry    45
Stan     78
Olaff    34
Name: Test1, dtype: int64

In [71]:
def standardization_2(datafram):
    return datafram.apply(standardization)

In [74]:
standardization_2(df_test_scores)

           Test1     Test2
Tom    21.106277  53.41997
Larry  43.106277  75.41997
Stan   76.106277  30.41997
Olaff  32.106277  86.41997

In [75]:
#Merge ,Duplicate and concateneate

In [76]:
import pandas as pd

In [78]:
df_student_math = pd.DataFrame({'students':['Tom','Harry','Peter','Clark','Robert'],'ID':[10,20,34,56,67]})

In [80]:
df_student_science = pd.DataFrame({'students':['Tom','Ram','Peter'],'ID':[10,45,34]})

In [81]:
#Use Merge

In [82]:
pd.merge(df_student_math,df_student_science)

  students  ID
0      Tom  10
1    Peter  34

In [84]:
#merge with key on student

pd.merge(df_student_math,df_student_science,on='students')

  students  ID_x  ID_y
0      Tom    10    10
1    Peter    34    34

In [86]:
#perform left Join using ID as a key and fillna as'0'

pd.merge(df_student_math,df_student_science, on='ID',how='left').fillna(0)

  students_x  ID students_y
0        Tom  10        Tom
1      Harry  20          0
2      Peter  34      Peter
3      Clark  56          0
4     Robert  67          0

In [87]:
pd.merge(df_student_math,df_student_science, on='ID',how='right').fillna(0)

  students_x  ID students_y
0        Tom  10        Tom
1      Peter  34      Peter
2          0  45        Ram

In [88]:
pd.concat([df_student_math,df_student_science],ignore_index=True)

  students  ID
0      Tom  10
1    Harry  20
2    Peter  34
3    Clark  56
4   Robert  67
5      Tom  10
6      Ram  45
7    Peter  34

In [91]:
df_student_data = pd.DataFrame({'students':['Tom','Harry','Tom','Peter','Clark','Robert'],'ID':[10,20,10,34,56,67]})

In [92]:
df_student_data

  students  ID
0      Tom  10
1    Harry  20
2      Tom  10
3    Peter  34
4    Clark  56
5   Robert  67

In [93]:
df_student_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [94]:
df_student_data.drop_duplicates('students')

  students  ID
0      Tom  10
1    Harry  20
3    Peter  34
4    Clark  56
5   Robert  67